app/controllers/votes_controller.rb

	def search
		@records = Vote.search_for(params[:search], :order => 'panel_no').page params[:page]
---
SELECT `votes`.* FROM `votes` ORDER BY `votes`.`panel_no` ASC LIMIT 5 OFFSET 0