app/views/votes/search.html.haml

SELECT `votes`.* FROM `votes` ORDER BY `votes`.`name` ASC
---
    %tr
      - Vote::ColumnNames.each do |column|